# YOLOv8n nano model configuration

# Model architecture
nc: 1  # Number of classes, adjust this according to your dataset (1 for atomic columns)
depth_multiple: 0.33  # Depth factor for scaling the model
width_multiple: 0.25  # Width factor for scaling the model

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Bottleneck, [64]],  # 1
   [-1, 1, BottleneckCSP, [128, 3]],  # 2-P2/4
   [-1, 1, BottleneckCSP, [256, 3]],  # 3-P3/8
   [-1, 1, BottleneckCSP, [512, 3]],  # 4-P4/16
   [-1, 1, BottleneckCSP, [1024, 3]],  # 5-P5/32
   [-1, 1, SPP, [1024, 5]],  # 6
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],  # 7
   [-1, 1, Conv, [1024, 3, 1]],  # 8
   [-1, 1, nn.Conv2d, [nc, 1, 1]],  # 9-Output classes
  ]
  
# Hyperparameters (optional, can be fine-tuned)
optimizer: SGD
lr0: 0.01
lrf: 0.01
momentum: 0.937
weight_decay: 0.0005
warmup_epochs: 3.0
warmup_momentum: 0.8
warmup_bias_lr: 0.1
box: 0.05
cls: 0.5
cls_pw: 1.0
obj: 1.0
obj_pw: 1.0
iou_t: 0.2
anchor_t: 4.0
fl_gamma: 0.0
hsv_h: 0.015
hsv_s: 0.7
hsv_v: 0.4
degrees: 0.0
translate: 0.1
scale: 0.5
shear: 0.0
perspective: 0.0
flipud: 0.0
fliplr: 0.5
mosaic: 1.0
mixup: 0.0
copy_paste: 0.0
